jetstream/web/configuration.org
* Header
#+NAME: header
#+BEGIN_SRC css :noweb yes :results none
  <link href='https://fonts.googleapis.com/css?family=Gentium+Book+Basic:400,400i,700' rel='stylesheet' />
  <style type='text/css'>
    <<style>>
  </style>
#+END_SRC

* Publishing configuration
#+BEGIN_SRC emacs-lisp :noweb yes :results none
  (defun create-postamble (options)
    (let ((input-file (plist-get options :input-file)))
      (concat
       "Last updated on "
       (current-time-string))))

  (defun create-project-configuration (title base-dir publishing-dir)
    `(
      (,title
       :base-directory ,base-dir
       :publishing-directory ,publishing-dir
       :base-extension "org"
       :recursive t
       :section-numbers nil
       :publishing-function org-html-publish-to-html
       :with-author nil
       :with-toc nil
       :html-head-include-scripts nil
       :html-head-extra "
      <<header>>
              "
       :html-validation-link nil
       :html-footnotes-section "<div class=\"footnotes\" title=\"%s\">%s</div>"
       :html-postamble ,'create-postamble)))

  (setq
   org-publish-project-alist
   `(,@(create-project-configuration
        "jetstream-site"
        "."
        "./publish/")
     ("jetstream-static"
      :base-directory "./static/"
      :publishing-directory "./publish/static/"
      :base-extension any
      :recursive t
      :publishing-function org-publish-attachment)
     ("jetstream"
      :components ("jetstream-site"
                   "jetstream-static"))))
#+END_SRC

* Publish
#+BEGIN_SRC emacs-lisp :eval no
  (org-publish "jetstream" nil)
  (global-set-key
   (kbd "C-c c")
   (lambda ()
     (interactive)
     (org-babel-load-file "configuration.org")))
  ; (org-babel-execute-buffer)
#+END_SRC
