jetstream/web/publish/configuration.html
     <span style="color: #006FE0;">:html-validation-link</span> nil
     <span style="color: #006FE0;">:html-footnotes-section</span> <span style="color: #008000;">"&lt;div class=\"footnotes\" title=\"%s\"&gt;%s&lt;/div&gt;"</span>
     <span style="color: #006FE0;">:html-postamble</span> ,'create-postamble<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">setq</span>
 org-publish-project-alist
 `<span style="color: #7388D6;">(</span>,@<span style="color: #909183;">(</span>create-project-configuration
      <span style="color: #008000;">"jetstream-site"</span>
      <span style="color: #008000;">"."</span>
      <span style="color: #008000;">"./publish/"</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #008000;">"jetstream-static"</span>
    <span style="color: #006FE0;">:base-directory</span> <span style="color: #008000;">"./static/"</span>
    <span style="color: #006FE0;">:publishing-directory</span> <span style="color: #008000;">"./publish/static/"</span>
    <span style="color: #006FE0;">:base-extension</span> any
    <span style="color: #006FE0;">:recursive</span> t
    <span style="color: #006FE0;">:publishing-function</span> org-publish-attachment<span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #008000;">"jetstream"</span>
    <span style="color: #006FE0;">:components</span> <span style="color: #709870;">(</span><span style="color: #008000;">"jetstream-site"</span>
                 <span style="color: #008000;">"jetstream-static"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Publish</h2>
<div class="outline-text-2" id="text-orgheadline5">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span>org-publish <span style="color: #008000;">"jetstream"</span> nil<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>global-set-key
 <span style="color: #7388D6;">(</span>kbd <span style="color: #008000;">"C-c c"</span><span style="color: #7388D6;">)</span>
 <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
   <span style="color: #909183;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>org-babel-load-file <span style="color: #008000;">"configuration.org"</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">(org-babel-execute-buffer)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last updated on Wed Dec 14 11:34:30 2016
</div>
</body>
</html>
